renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_irq_rx/src/r_irq_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2013-2019 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_irq_rx.c
* Device(s)    : Renesas RX Family
* Tool-Chain   : Renesas RX Standard Toolchain  
* H/W Platform : 
* Description  : IRQ support API for RX Family MCUs
***********************************************************************************************************************/
/***********************************************************************************************************************
* History : DD.MM.YYYY  Version Description
*         : 15.07.2013  1.00    First Release
*         : 10.02.2014          Additional list of supported MCUs in comments. No change to code.
*         : 04.04.2014  1.20    Using the definition of VECT_ICU_IRQ15 to check the number of IRQs.
*         : 30.09.2015  1.70    Using the definition of VECT_ICU_IRQ7  to check the number of IRQs.
*         : 15.03.2016  2.00    Applied the coding rules of Renesas.
*         : 07.09.2016  2.10    Applied the coding rules of Renesas.
*         : 28.09.2018  2.30    Updated GSCE coding rules.
*         : 20.05.2019  3.00    Added support for GNUC and ICCRX.
*         : 15.08.2019  3.20    Fixed warnings in IAR.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "platform.h"
#include "r_irq_rx_if.h"
#include "r_irq_rx_config.h"
#include "r_irq_rx_private.h"


/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define IRQ_VECT_BASE   (VECT_ICU_IRQ0)   /* IRQ vector numbers are all offsets from here. */
#define IRQ_IPR_BASE    (IPR_ICU_IRQ0)    /* IRQ priority register locations are all offsets from here. */

#define IRQ_TRIGGER_MASK (0xF3)            /* Reserved bits in IRQ detection sense register. */

/***********************************************************************************************************************
Exported global variables and functions
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

#if IRQ_CFG_USE_IRQ0 == 1
irq_callback p_callback_irq0;
const irq_init_block_t g_irq0_handle =
{
    IRQ_NUM_0,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ0,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ0,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ0,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ0,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq0,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ0.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ0,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ1 == 1
irq_callback p_callback_irq1;
const irq_init_block_t g_irq1_handle =
{
    IRQ_NUM_1,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ1,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ1,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ1,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ1,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq1,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ1.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ1,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ2 == 1
irq_callback p_callback_irq2;
const irq_init_block_t g_irq2_handle =
{
    IRQ_NUM_2,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ2,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ2,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ2,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ2,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq2,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ2.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ2,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ3 == 1
irq_callback p_callback_irq3;
const irq_init_block_t g_irq3_handle =
{
    IRQ_NUM_3,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ3,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ3,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ3,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ3,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq3,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ3.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ3,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ4 == 1
irq_callback p_callback_irq4;
const irq_init_block_t g_irq4_handle =
{
    IRQ_NUM_4,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ4,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ4,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ4,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ4,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq4,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ4.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ4,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ5 == 1
irq_callback p_callback_irq5;
const irq_init_block_t g_irq5_handle =
{
    IRQ_NUM_5,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ5,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ5,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ5,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ5,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq5,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ5.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ5,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if defined(VECT_ICU_IRQ7)
#if IRQ_CFG_USE_IRQ6 == 1
irq_callback p_callback_irq6;
const irq_init_block_t g_irq6_handle =
{
    IRQ_NUM_6,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ6,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ6,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ6,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ6,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq6,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ6.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ6,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ7 == 1
irq_callback p_callback_irq7;
const irq_init_block_t g_irq7_handle =
{
    IRQ_NUM_7,                            /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ7,         /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ7,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ7,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ7,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq7,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ7.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ7,                   /* I/O port input data bit mask for this IRQ. */
};
#endif
#endif

