renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_irq_rx/src/r_irq_rx.c
#if defined(VECT_ICU_IRQ15)
#if IRQ_CFG_USE_IRQ8 == 1
irq_callback p_callback_irq8;
const irq_init_block_t g_irq8_handle =
{
    IRQ_NUM_8,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ8,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ8,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ8,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ8,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq8,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ8.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ8,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ9 == 1
irq_callback p_callback_irq9;
const irq_init_block_t g_irq9_handle =
{
    IRQ_NUM_9,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ9,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ9,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ9,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ9,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq9,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ9.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ9,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ10 == 1
irq_callback p_callback_irq10;
const irq_init_block_t g_irq10_handle =
{
    IRQ_NUM_10,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ10,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ10,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ10,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ10,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq10,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ10.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ10,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ11 == 1
irq_callback p_callback_irq11;
const irq_init_block_t g_irq11_handle =
{
    IRQ_NUM_11,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ11,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ11,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ11,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ11,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq11,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ11.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ11,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ12 == 1
irq_callback p_callback_irq12;
const irq_init_block_t g_irq12_handle =
{
    IRQ_NUM_12,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ12,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ12,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ12,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ12,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq12,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ12.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ12,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ13 == 1
irq_callback p_callback_irq13;
const irq_init_block_t g_irq13_handle =
{
    IRQ_NUM_13,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ13,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ13,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ13,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ13,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq13,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ13.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ13,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

#if IRQ_CFG_USE_IRQ14 == 1
irq_callback p_callback_irq14;
const irq_init_block_t g_irq14_handle =
{
    IRQ_NUM_14,                           /* IRQ number. */
    (uint8_t)IRQ_IEN_MASK_IRQ14,          /* Bit position of interrupt enable bit in interrupt enable register. */
    (uint8_t)IER_ICU_IRQ14,               /* Index to the Interrupt enable register location for this interrupt. */
    (uint8_t)IRQ_CFG_FILT_PLCK_IRQ14,     /* PCLK divisor setting for the input pin digital filter. */
    (uint8_t)IRQ_CFG_FILT_EN_IRQ14,       /* Filter enable setting (on or off) for the input pin digital filter. */
    &p_callback_irq14,                    /* pointer to callback function pointer. */
    (uint8_t *)&IRQ_PORT_IRQ14.PIDR.BYTE,   /* Pointer to the I/O port input data register for this IRQ. */
    IRQ_PORT_BIT_IRQ14,                   /* I/O port input data bit mask for this IRQ. */
};
#endif

