renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_irq_rx/src/r_irq_rx.c
    /* Disable interrupt request. */
    ICU.IER[ier_index].BYTE &= (~ien_mask);

#if defined(VECT_ICU_IRQ15)
    if (7 >= irq_number) /* IRQs 0-7 share these registers. */
    {
#endif
        /* Disable digital filter.  */
        ICU.IRQFLTE0.BYTE &= (~ien_mask);

        /* Set up the digital filter sampling clock divisor IRQFLTC0.FCLKSELi[1:0] bits for the IRQ. */
        ICU.IRQFLTC0.WORD &= (uint16_t)~(0x0003 << (irq_number * 2));                   /* First clear them. */
        ICU.IRQFLTC0.WORD |= ((uint16_t)(my_handle->filt_clk_div) << (irq_number * 2)); /* Now set them. */
#if defined(VECT_ICU_IRQ15)
    }

    else  /* IRQs 8-15 share these registers. */
    {
         /* Disable digital filter.  */
        ICU.IRQFLTE1.BYTE &= (~ien_mask);

        /* Set up the digital filter sampling clock divisor IRQFLTC0.FCLKSELi[1:0] bits for the IRQ. */
        ICU.IRQFLTC1.WORD &= (uint16_t)~(0x0003 << ((irq_number - 8) * 2));             /* First clear them. */
        ICU.IRQFLTC1.WORD |= ((uint16_t)(my_handle->filt_clk_div) << ((irq_number - 8) * 2)); /* Now set them. */
    }
#endif

    /* Set the method of detection for the interrupt in the IRQCRi.IRQMD[1:0] bits. */
    ICU.IRQCR[irq_number].BYTE = (uint8_t)trigger;


    if(IRQ_TRIG_LOWLEV != trigger)
    {
        /* Clear the corresponding IRn.IR flag to 0 (if edge detection is in use). */
        ICU.IR[IRQ_VECT_BASE + irq_number].BYTE = 0;
    }

#if defined(VECT_ICU_IRQ15)
    if (7 >= irq_number) /* IRQs 0-7. */
    {
#endif
        /* Set the IRQFLTEn.FLTENi bit (digital filter enabled) according to user configuration. */
        ICU.IRQFLTE0.BYTE |= (uint8_t)(((my_handle->filt_enable) << irq_number) & ien_mask);
#if defined(VECT_ICU_IRQ15)
    }
    else
    {
        /* Set the IRQFLTEn.FLTENi bit (digital filter enabled) according to user configuration. */
        ICU.IRQFLTE1.BYTE |= (uint8_t)(((my_handle->filt_enable) << (irq_number - 8)) & ien_mask);
    }
#endif

    /* Set the interrupt priority level. */
    ICU.IPR[IRQ_IPR_BASE + (uint8_t)irq_number].BYTE = (uint8_t)(priority & 0x0F);

    *(my_handle->pirq_callback) = pcallback; /* Assign the callback function pointer. */

    *phandle = my_handle;   /* Return a pointer to a handle for the IRQ. */

#if IRQ_CFG_PARAM_CHECKING == 1
    girq_opened[irq_number] = 1;      /* Flag that IRQ has now been opened. */
#endif

    /* Set the IERm.IENj bit to 1 (interrupt request enabled). */
    ICU.IER[ier_index].BYTE |= ien_mask;   /* Enable interrupt request. */

#if IRQ_CFG_REQUIRE_LOCK == 1
    /* Release lock for this IRQ. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_IRQ0 + (uint8_t)irq_number));
#endif
    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_Open
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_IRQ_Control
* Description  : Handles special hardware or software operations for the IRQ.
* Arguments    : handle -
*                    Pointer to the handle for the IRQ.
*                cmd -
*                    Enumerated command code:  enable filtering, disable filtering, set filter clock, set priority
*                pcmd_data -
*                    Pointer to the command-data structure parameter of type void that is used to reference the location
*                    of any data specific to the command that is needed for its completion.
* Return Value : IRQ_SUCCESS -
*                    Command successfully completed.
*                IRQ_ERR_BAD_NUM -
*                    IRQ number is invalid or unavailable.
*                IRQ_ERR_NOT_OPENED -
*                    The IRQ has not been opened.  Perform R_IRQ_Open() first
*                IRQ_ERR_UNKNOWN_CMD-
*                    Control command is not recognized.
*                IRQ_ERR_INVALID_PTR -
*                    pcmd_data  pointer or handle pointer is NULL
*                IRQ_ERR_INVALID_ARG -
*                    An element of the pcmd_data structure contains an invalid value.
*                IRQ_ERR_LOCK -
*                    The lock could not be acquired.
***********************************************************************************************************************/
irq_err_t   R_IRQ_Control(irq_handle_t  const handle,
                          irq_cmd_t     const cmd,
                          void               *pcmd_data)
{
    irq_err_t ret = IRQ_SUCCESS;
    irq_prio_t    *prio_cmd_dat;
    irq_trigger_t *ptrig_cmd_dat;
    uint8_t irq_number = 0;         /* Place for dereferenced IRQ number. */
    uint8_t ien_temp;               /* For saving interrupt enable state. */
    uint8_t ier_index;              /* For holding decoded IER register number index.*/

#if IRQ_CFG_REQUIRE_LOCK == 1
    bool        lock_result = false;
#endif

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if ((NULL == handle) || (NULL == pcmd_data))
    {
        return IRQ_ERR_INVALID_PTR;
    }

    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }

    if (!(girq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
    if (IRQ_CMD_LIST_END <= cmd)
    {
        return IRQ_ERR_UNKNOWN_CMD;
    }
#endif
    irq_number = handle->irq_num;
    ier_index  = handle->ier_reg_index;

#if IRQ_CFG_REQUIRE_LOCK == 1
    /* Attempt to acquire lock for this IRQ. Prevents reentrancy conflict. */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));

    if(false == lock_result)
    {
        return IRQ_ERR_LOCK; /* The open function is currently locked. */
    }
#endif

    /* Save a copy so it can be restored later. */
    ien_temp = ICU.IER[ier_index].BYTE;

