renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_irq_rx/src/r_irq_rx.c
    /* Disable interrupt request. */
    ICU.IER[ier_index].BYTE &= (~(handle->ien_bit_mask));

    if(IRQ_CMD_SET_PRIO == cmd)
    {
        /* casting void * type to irq_prio_t* type is valid */
        prio_cmd_dat = (irq_prio_t*)pcmd_data;

        #if IRQ_CFG_PARAM_CHECKING == 1
        if ((*prio_cmd_dat) > BSP_MCU_IPL_MAX)
        {
            #if IRQ_CFG_REQUIRE_LOCK == 1
            /* Release lock for this IRQ. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));
            #endif
            return IRQ_ERR_INVALID_ARG;
        }
        #endif

        /* Set the interrupt priority level. */
        ICU.IPR[IRQ_IPR_BASE + irq_number].BYTE = (uint8_t)((*prio_cmd_dat) & 0x0F);
    }
    else if(IRQ_CMD_SET_TRIG == cmd)
    {
        /* casting void * type to irq_trigger_t* type is valid */
        ptrig_cmd_dat = (irq_trigger_t*)pcmd_data;

        #if IRQ_CFG_PARAM_CHECKING == 1
        if ((*ptrig_cmd_dat) & IRQ_TRIGGER_MASK)
        {
            #if IRQ_CFG_REQUIRE_LOCK == 1
            /* Release lock for this IRQ. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));
            #endif
            return IRQ_ERR_INVALID_ARG;
        }
        #endif

        /* Set the method of detection for the interrupt in the IRQCRi.IRQMD[1:0] bits. */
        ICU.IRQCR[irq_number].BYTE = (uint8_t)(*ptrig_cmd_dat);


        if(IRQ_TRIG_LOWLEV != (*ptrig_cmd_dat))
        {
            /* Clear the corresponding IRn.IR flag to 0 (if edge detection is in use). */
            ICU.IR[IRQ_VECT_BASE + irq_number].BYTE = 0;
        }
    }
    else
    {
     /* Nothing else. New commands would go here. */
    }

    /* Restore original interrupt enable state. */
    ICU.IER[ier_index].BYTE = ien_temp;

#if IRQ_CFG_REQUIRE_LOCK == 1
    /* Release lock for this IRQ. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_IRQ0 + irq_number));
#endif
    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_Control
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_IRQ_Close
* Description  : Fully disables the IRQ designated by the handle.
* Arguments    : handle -
*                    Pointer to the handle for the IRQ.
* Return Value : IRQ_SUCCESS -
*                    Successful; IRQ closed.
*                IRQ_ERR_BAD_NUM -
*                    IRQ number is invalid or unavailable.
*                IRQ_ERR_NOT_OPENED -
*                    The IRQ has not been opened so closing has no effect.
*                IRQ_ERR_INVALID_PTR -
*                    A required pointer argument is NULL
***********************************************************************************************************************/
irq_err_t   R_IRQ_Close(irq_handle_t handle)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if (NULL == handle)
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(girq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    /* Disable interrupt request. */
    ICU.IER[handle->ier_reg_index].BYTE &= (~(handle->ien_bit_mask));

#if defined(VECT_ICU_IRQ15)
    if (7 >= handle->irq_num) /* IRQs 0-7 share these registers. */
    {
#endif
        /* Disable digital filter.  */
        ICU.IRQFLTE0.BYTE &= (~(handle->ien_bit_mask));
#if defined(VECT_ICU_IRQ15)
    }

    else  /* IRQs 8-15 share these registers. */
    {
        /* Disable digital filter.  */
        ICU.IRQFLTE1.BYTE &= (~(handle->ien_bit_mask));
    }
#endif

#if IRQ_CFG_PARAM_CHECKING == 1
    girq_opened[handle->irq_num] = 0;      /* Flag that IRQ has now been closed. */
#endif

    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_Close
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_IRQ_ReadInput
* Description  : Reads the current level of the pin assigned to the specified IRQ.
* Arguments    : handle -
*                    Handle pointer for the IRQ.
*                plevel -
*                    Pointer to storage for the returned value of the input level.
* Return Value : IRQ_SUCCESS -
*                    Operation successfully completed.
*                IRQ_ERR_BAD_NUM -
*                    IRQ number is invalid or unavailable.
*                IRQ_ERR_NOT_OPENED -
*                    The IRQ has not been opened.  Perform R_IRQ_Open() first
*                IRQ_ERR_INVALID_PTR -
*                    handle pointer is NULL
***********************************************************************************************************************/
irq_err_t   R_IRQ_ReadInput(irq_handle_t const handle, uint8_t *plevel)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if ((NULL == handle) || (NULL == plevel))
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(girq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    /* casting handle * type to uint8_t* type is valid */
    *plevel = (uint8_t)((*handle->pirq_in_port) & handle->irq_port_bit);

    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_ReadInput
***********************************************************************************************************************/

