renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_irq_rx/src/r_irq_rx.c
/***********************************************************************************************************************
* Function Name: R_IRQ_InterruptEnable
* Description  : Enables or disables the ICU interrupt for the specified IRQ.
* Arguments    : handle -
*                    Handle pointer for the IRQ.
*                enable -
*                    true  = enable the interrupt. false = disable interrupt.
* Return Value : IRQ_SUCCESS -
*                    Operation successfully completed.
*                IRQ_ERR_BAD_NUM -
*                    IRQ number is invalid or unavailable.
*                IRQ_ERR_NOT_OPENED -
*                    The IRQ has not been opened.  Perform R_IRQ_Open() first
*                IRQ_ERR_INVALID_PTR -
*                    handle pointer is NULL
***********************************************************************************************************************/
irq_err_t   R_IRQ_InterruptEnable (irq_handle_t const handle, bool enable)
{
    irq_err_t ret = IRQ_SUCCESS;

    /* Validate input arguments. */
#if IRQ_CFG_PARAM_CHECKING == 1
    if (NULL == handle)
    {
        return IRQ_ERR_INVALID_PTR;
    }
    if (IRQ_NUM_MAX <= handle->irq_num)
    {
        return IRQ_ERR_BAD_NUM;
    }
    if (!(girq_opened[handle->irq_num])) /* Check for IRQ not opened. */
    {
        return  IRQ_ERR_NOT_OPENED;
    }
#endif

    if(enable)
    {
        /* Enable interrupt request. */
        ICU.IER[handle->ier_reg_index].BYTE |= handle->ien_bit_mask;
    }
    else
    {
        /* Disable interrupt request. */
        ICU.IER[handle->ier_reg_index].BYTE &= (~(handle->ien_bit_mask));
    }

    /* dummy read to complete pipelining. */
    if(ICU.IER[handle->ier_reg_index].BYTE)
    {
        R_BSP_NOP();
    }

    return ret;
}
/***********************************************************************************************************************
End of function R_IRQ_InterruptEnable
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_IRQ_GetVersion
* Description : Returns the version of this module. The version number is
* encoded where the top 2 bytes are the major version number and
* the bottom 2 bytes are the minor version number.
* For example, Rev 4.25 would be 0x00040019.
* NOTE: This function is inlined using #pragma inline directive.
* Arguments : none
* Return Value : Version Number
***********************************************************************************************************************/
uint32_t R_IRQ_GetVersion(void)
{
    uint32_t version_number = 0;

    /* Bring in major version number. */
    version_number = ((uint16_t)IRQ_RX_VERSION_MAJOR) << 16;

    /* Bring in minor version number. */
    version_number |= (uint16_t)IRQ_RX_VERSION_MINOR;
    return version_number;
}
/***********************************************************************************************************************
End of function R_IRQ_GetVersion
***********************************************************************************************************************/

/***********************************************************************************************************************
* Description  : IRQ interrupt handler routines.
***********************************************************************************************************************/
#if IRQ_CFG_USE_IRQ0 == 1
R_BSP_PRAGMA_INTERRUPT (irq0_isr,VECT(ICU, IRQ0))
/***********************************************************************************************************************
* Function Name: irq0_isr
* Description  : IRQ0 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq0_isr(void)
{
    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq0_handle.pirq_callback))) && (NULL != (*(g_irq0_handle.pirq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq0_handle.pirq_callback))((void*)&(g_irq0_handle));
    }
} /* End of function irq0_isr */
#endif

#if IRQ_CFG_USE_IRQ1 == 1
R_BSP_PRAGMA_INTERRUPT (irq1_isr, VECT(ICU, IRQ1))
/***********************************************************************************************************************
* Function Name: irq1_isr
* Description  : IRQ1 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq1_isr(void)
{
    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq1_handle.pirq_callback))) && (NULL != (*(g_irq1_handle.pirq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq1_handle.pirq_callback))((void*)&(g_irq1_handle.irq_num));
    }
} /* End of function irq1_isr */
#endif

#if IRQ_CFG_USE_IRQ2 == 1
R_BSP_PRAGMA_INTERRUPT (irq2_isr,VECT(ICU, IRQ2))
/***********************************************************************************************************************
* Function Name: irq2_isr
* Description  : IRQ2 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq2_isr(void)
{
    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq2_handle.pirq_callback))) && (NULL != (*(g_irq2_handle.pirq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq2_handle.pirq_callback))((void*)&(g_irq2_handle.irq_num));
    }
} /* End of function irq2_isr */
#endif

#if IRQ_CFG_USE_IRQ3 == 1
R_BSP_PRAGMA_INTERRUPT (irq3_isr,VECT(ICU, IRQ3))
/***********************************************************************************************************************
* Function Name: irq3_isr
* Description  : IRQ3 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq3_isr(void)
{
    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq3_handle.pirq_callback))) && (NULL != (*(g_irq3_handle.pirq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq3_handle.pirq_callback))((void*)&(g_irq3_handle.irq_num));
    }
} /* End of function irq3_isr */
#endif

#if IRQ_CFG_USE_IRQ4 == 1
R_BSP_PRAGMA_INTERRUPT (irq4_isr, VECT(ICU, IRQ4))
/***********************************************************************************************************************
* Function Name: irq4_isr
* Description  : IRQ4 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq4_isr(void)
{
    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq4_handle.pirq_callback))) && (NULL != (*(g_irq4_handle.pirq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq4_handle.pirq_callback))((void*)&(g_irq4_handle.irq_num));
    }
} /* End of function irq4_isr */
#endif

#if IRQ_CFG_USE_IRQ5 == 1
R_BSP_PRAGMA_INTERRUPT (irq5_isr, VECT(ICU, IRQ5))
/***********************************************************************************************************************
* Function Name: irq5_isr
* Description  : IRQ5 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq5_isr(void)
{
    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq5_handle.pirq_callback))) && (NULL != (*(g_irq5_handle.pirq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq5_handle.pirq_callback))((void*)&(g_irq5_handle.irq_num));
    }
} /* End of function irq5_isr */
#endif

#if defined(VECT_ICU_IRQ7)
#if IRQ_CFG_USE_IRQ6 == 1
R_BSP_PRAGMA_INTERRUPT (irq6_isr,VECT(ICU, IRQ6))
/***********************************************************************************************************************
* Function Name: irq6_isr
* Description  : IRQ6 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq6_isr(void)
{
    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq6_handle.pirq_callback))) && (NULL != (*(g_irq6_handle.pirq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq6_handle.pirq_callback))((void*)&(g_irq6_handle.irq_num));
    }
} /* End of function irq6_isr */
#endif

#if IRQ_CFG_USE_IRQ7 == 1
R_BSP_PRAGMA_INTERRUPT (irq7_isr,VECT(ICU, IRQ7))
/***********************************************************************************************************************
* Function Name: irq7_isr
* Description  : IRQ7 callback function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
R_BSP_ATTRIB_INTERRUPT void irq7_isr(void)
{
    /* check callback address */
    if((FIT_NO_FUNC != (*(g_irq7_handle.pirq_callback))) && (NULL != (*(g_irq7_handle.pirq_callback))))
    {
        /* casting void * type to callback* type is valid */
        (*(g_irq7_handle.pirq_callback))((void*)&(g_irq7_handle.irq_num));
    }
} /* End of function irq7_isr */
#endif
#endif /* End of #if defined(VECT_ICU_IRQ7) */

